In [1]:
import numpy as np
import pandas as pd

In [2]:
b = [1,2,3]

In [4]:
pd.DataFrame(b)

   0
0  1
1  2
2  3

In [5]:
c = [[1,2,3], [4,5,6]]
pd.DataFrame(c)

   0  1  2
0  1  2  3
1  4  5  6

In [6]:
np.array(c)

array([[1, 2, 3],
       [4, 5, 6]])

In [7]:
d = pd.DataFrame(c)
d

   0  1  2
0  1  2  3
1  4  5  6

In [8]:
type(d)

pandas.core.frame.DataFrame

In [9]:
d.columns

RangeIndex(start=0, stop=3, step=1)

In [10]:
d.index

RangeIndex(start=0, stop=2, step=1)

In [11]:
d = {'name':['gaurav', 'istiaque'], 'salary':[20000, 30000], 'company':['Eduviden', 'Eduviden']}
d

{'name': ['gaurav', 'istiaque'],
 'salary': [20000, 30000],
 'company': ['Eduviden', 'Eduviden']}

In [13]:
pd.DataFrame(d)

       name  salary   company
0    gaurav   20000  Eduviden
1  istiaque   30000  Eduviden

In [18]:
pd.DataFrame(np.array([list(range(0,4)), list(range(4,8)), list(range(8,12))]), columns = ['A', 'B', 'C', 'D'])

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [19]:
df = pd.DataFrame(np.array([list(range(0,4)), list(range(4,8)), list(range(8,12))]))
df

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [20]:
df.columns = ['A', 'B', 'C', 'D']

In [21]:
df

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [22]:
df.index = ['a', 'b', 'c']

In [23]:
df

   A  B   C   D
a  0  1   2   3
b  4  5   6   7
c  8  9  10  11

In [24]:
df['A']

a    0
b    4
c    8
Name: A, dtype: int32

In [25]:
type(df['A'])

pandas.core.series.Series

In [26]:
df[['A']]

   A
a  0
b  4
c  8

In [28]:
df[['A', 'B']]

   A  B
a  0  1
b  4  5
c  8  9

In [ ]:
# series can only contain 1 column - []

In [32]:
df = pd.DataFrame(np.array([[0,1,2,3, np.nan], [4,5,6,7, np.nan], [8,9,10,11, 12]]))
df

     0    1     2     3     4
0  0.0  1.0   2.0   3.0   NaN
1  4.0  5.0   6.0   7.0   NaN
2  8.0  9.0  10.0  11.0  12.0

In [34]:
type(np.nan)

float

In [39]:
df1 = pd.DataFrame(np.array([[0,1,'2',3, 5], [4,5,6,7, np.nan], [8,9,10,11, 12]]))
df1

   0  1   2   3    4
0  0  1   2   3    5
1  4  5   6   7  nan
2  8  9  10  11   12

In [40]:
df1.dtypes

0    object
1    object
2    object
3    object
4    object
dtype: object

In [41]:
df2 = pd.DataFrame([[0,1,'2',3, 5], [4,5,6,7, np.nan], [8,9,10,11, 12]])
df2

   0  1   2   3     4
0  0  1   2   3   5.0
1  4  5   6   7   NaN
2  8  9  10  11  12.0

In [42]:
df2.dtypes

0      int64
1      int64
2     object
3      int64
4    float64
dtype: object

In [45]:
df2.isnull().sum()

0    0
1    0
2    0
3    0
4    1
dtype: int64

In [46]:
df1.isnull().sum()

0    0
1    0
2    0
3    0
4    0
dtype: int64